export const AfterComboSplashes = [
	'ДАВАЙ ДАВАЙ УРАА',
	'мегахарош',
	'К-к-к-комбо!',
	'standing here, i realize...',
	'да ты заебала уворачиваться',
]

export const RandomStageMessages = {
	0: [
		'* Состояние объекта: СТАБИЛЬНО',
		'* Данные сохраняются каждую минуту!',
		'* На этапе обучения вам доступно только НЕлетальное оружие.',
		'* Пишите ваши идеи в группу MIE!',
	],
	1: [
		'* Состояние объекта: СТАБИЛЬНО(?)',
		'* Данные также сохраняются при закрытии вкладки!',
		'* Вам доступно летальное оружие и рабочая сила.',
		'* ',
	],
}

export const NextStageMessages = {
	0: [
		'Приветствуем, {name}!\nФонд MIE поздравляет вас со сменой работы!',
		'Теперь вы работаете удалённо и на большом расстоянии от объекта. Ваша задача - проводить эксперименты на MIE-001, для этого вам будут предоставлены все нужные предметы.',
		'Все действия вы будете производить дистанционно, поэтому вы не ограничены в своих действиях.',
		'Насчёт зарплаты вы можете обратиться через корпоративную почту: pupa+accounting@mie.local',
		'Удачи на вашей новой работе!'
	],
	1: [
		'Здравствуйте, {name}!\nПоходу вы отлично освоились тут.',
		'Более того - вы получили {ml}мл крови Объекта. Это позволит нам узнать как ей удаётся восстанавливаться так быстро.',
		'Продолжайте в том же духе!'
	],
	2: [],
}
