export const AfterComboSplashes = [
	'ДАВАЙ ДАВАЙ УРАА',
	'мегахарош',
	'К-к-к-комбо!',
	'standing here, i realize...',
	'да ты заебала уворачиваться',
]

export const RandomStageMessages = {
	0: [
		'* Это слишком очевидно, но комбо умножает отдаваемый урон!',
		'* Данные сохраняются каждую минуту и при выходе из игры.',
		'* На данном этапе вам доступно только НЕлетальное оружие.',
		'* Сообщайте о багах системы вашему администратору!',
	],
	1: [
		'* Состояние объекта: СТАБИЛЬНО?',
 		'* Ваши сотрудники будут работать даже в ваше отсутствие!',
		'* Вам доступно летальное оружие и рабочая сила.',
		'* Теперь вы можете возвращать средства за некоторые улучшения!',
	],
}

export const NextStageMessages = {
	0: [
		'Приветствуем, {name}!\nФонд MIE поздравляет вас со сменой работы!',
		'Теперь вы работаете удалённо и на большом расстоянии от объекта. Ваша задача - проводить эксперименты на MIE-001.',
		'Для этого вам будут предоставлены предметы, которые вы можете запрашивать в обмен на внутреннюю валюту - Энтропию.',
		'Все действия вы будете производить дистанционно, поэтому вы не ограничены в своих действиях.',
		'Насчёт зарплаты вы можете обратиться через корпоративную почту: pupa+lupa@accounting.mie.local',
		'Удачи на вашей новой работе!'
	],
	1: [
		'Здравствуйте, {name}!\nПоходу вы отлично освоились тут.',
		'Более того - вы получили {ml}мл крови Объекта. Это позволит ускорить наши исследования.',
		'Отчасти, мы должны узнать каким образом Объект так быстро восстанавливается у вас на глазах.',
		'Продолжайте в том же духе!'
	],
	2: [],
}
